namespace ETModel.Script.Model
{

    public enum DiamondZHLogEnum
    {
        上下分砖石 = 1,
        购买金币礼包 = 2,
        开通月年卡 = 3,
        升级联盟 = 4,
        升级club = 5,
        购买联盟币 = 6,
        购买基金 = 7,
        强制亮牌 = 8,
        查看余牌 = 9,
        开房扣除 = 10,
        申请延时 = 11,
        club名称 = 12,
        修改昵称 = 13,
        创建联盟 = 14,
        发弹幕 = 20,
        发表情 = 21,

    }
    public enum DiamondBIGLogEnum
    {
        上下分磚石 = 1,
        購買金幣禮包 = 2,
        開通月年卡 = 3,
        陞級聯盟 = 4,
        陞級俱樂部 = 5,
        購買聯盟幣 = 6,
        購買基金 = 7,
        強制亮牌 = 8,
        查看餘牌 = 9,
        開房扣除 = 10,
        申請延時 = 11,
        俱樂部名稱 = 12,
        修改昵稱 = 13,
        創建聯盟 = 14,
        發彈幕 = 20,
        發表情 = 21
    }
    /// <summary>
    /// 英文
    /// </summary>
    public enum DiamondENLogEnum
    {
        上下分砖石 = 1,
        购买金币礼包 = 2,
        开通月年卡 = 3,
        升级联盟 = 4,
        升级club = 5,
        购买联盟币 = 6,
        购买基金 = 7,
        强制秀牌 = 8,
        查看余牌 = 9,
        开房扣除 = 10,
        申请延时 = 11,
        发弹幕 = 20,
        发表情 = 21,
    }
}
